_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 320)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 5)                 1605      
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
