_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 32, 32, 5)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 16, 16, 5)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 320)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 5)                 1605      
_________________________________________________________________
dropout_4 (Dropout)          (None, 5)                 0         
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
