_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 5)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 5)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 5)           0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 1605      
_________________________________________________________________
dropout_4 (Dropout)          (None, 5)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
