_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 64, 64, 3)         84        
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 32, 32, 3)         0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 3072)              0         
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 6146      
=================================================================
Total params: 6,230
Trainable params: 6,230
Non-trainable params: 0
_________________________________________________________________
