_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 1605      
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
