_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 32, 32, 5)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 16, 16, 5)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 5)                 1605      
_________________________________________________________________
dropout_8 (Dropout)          (None, 5)                 0         
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
