_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 32, 32, 5)         0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 16, 16, 5)         0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 5)                 1605      
_________________________________________________________________
dropout_16 (Dropout)         (None, 5)                 0         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
