_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_34 (Conv2D)           (None, 64, 64, 5)         380       
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 32, 32, 5)         0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 32, 32, 5)         230       
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 16, 16, 5)         0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 16, 16, 5)         230       
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 8, 8, 5)           0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 320)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 5)                 1605      
_________________________________________________________________
dense_26 (Dense)             (None, 2)                 12        
=================================================================
Total params: 2,457
Trainable params: 2,457
Non-trainable params: 0
_________________________________________________________________
